app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."post_type" = 'photo'
---
  def photos
    @posts = Post.where(:post_type => "photo")

SELECT "posts".* FROM "posts" WHERE "posts"."post_type" = 'song'
---
  def songs
    @posts = Post.where(:post_type => "song")

SELECT "posts".* FROM "posts" WHERE "posts"."post_type" = 'news'
---
  def news
    @posts = Post.where(:post_type => "news")

SELECT "posts".* FROM "posts"
---
  def admin
    @posts = Post.all

INSERT INTO "posts" ("body", "created_at", "post_type", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @post = Post.new(params[:post])
    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "body" = 'Hey, this is a test post man!&nbsp; Were a fuckin band now bitch! So if your not listening, then get the fuck out!<br>&nbsp;<img src="http://img812.imageshack.us/img812/544/18767572.jpg" width="250"><br>', "mp3_url" = '', "ogg_url" = '', "updated_at" = '2012-02-12 01:28:21.552496' WHERE "posts"."id" = 1
---
  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(params[:post])